Repository: sevengram/astrotortilla
Catalog: locale/*/LC_MESSAGES/AstroTortilla.po
Languages: fi

source: Busy
fi: Varattu

source: Downloading
fi: Ladataan

source: Error
fi: Virhe

source: Exposing
fi: Valottaa

source: Idle
fi: Vapaa

source: Reading
fi: Luetaan

source: Waiting
fi: Odottaa

source: Astro Photography Tool TCP port
fi: Astro Photography Toolin TCP portti

source: Port
fi: Portti

source: default 21701
fi: oletus 21701

source: Hostname
fi: Koneen osoite

source: Hostname or IP address
fi: Nimi tai IP-osoite

source: Default camera
fi: Oletuskamera

source: Not connected
fi: Ei yhdistetty

source: Left margin
fi: Vasen reunus

source: Right margin
fi: Oikea reunus

source: Top margin
fi: Yl‰reunus

source: Bottom margin
fi: Alareunus

source: Window class
fi: Ikkunaluokka

source: Regex match filter
fi: S‰‰nnˆllinen lausekesuodin

source: Window title
fi: Ikkunan otsake

source: Screen capture
fi: Ruutukaappaus

source: '%s' is not a known window
fi: '%s' ei ole tunnettu ikkuna

source: Directory
fi: Hakemisto

source: File Open dialog
fi: Avaa tiedosto

source: Choose file to solve
fi: Valitse tiedosto ratkottavaksi

source: Image files
fi: Kuvatiedostot

source: -1 for none
fi: -1 = ei mik‰‰n

source: Filter
fi: Suodatin

source: Filter index for plate solve capture
fi: Ratkottavan kuvan ottamiseen k‰ytett‰v‰n suotimen numero

source: Dispatching Maxim.CCDCamera failed
fi: Maxim.CCDCamera:n kutsuminen ep‰onnistui

source: Nebulosity Path
fi: Nebulosityn polku

source: 2 or 3
fi: 2 tai 3

source: Nebulosity 2 or 3
fi: Nebulosityn 2 vai 3

source: Set camera
fi: Aseta kamera

source: Set camera model on capture
fi: Aseta kameramalli kuvatessa

source: True or False
fi: 'True' tai 'False'

source: Set ext filter
fi: Aseta ExtFilter -suodin

source: Set ext filter before solving
fi: Aseta ExtFilter -suodin ennen ratkontaa

source: Filter index or -1
fi: Suotimen numero tai -1

source: Set filter
fi: Aseta Filter -suodin

source: Set filter before solving
fi: Aseta Filter -suodin ennen ratkontaa

source: %(date)s = current date, %(night)s = current date at dusk
fi: %(date)s = tarkka p‰iv‰, %(night)s = p‰iv‰m‰‰r‰ illalla

source: After capture directory
fi: Normaali kuvaushakemisto

source: Reset directory to
fi: Palauta kuvaushakemistoksi

source: Nebulosity not responding to script loading
fi: Nebulosity ei vastaa

source: Not selected
fi: Ei valittu

source: ERROR: No solver selected.
fi: VIRHE: Ratkojaa ei ole valittu.

source: Solving...
fi: Ratkotaan...

source: Solved in %.1fs
fi: Ratkaistu %.1f sekunnissa

source: No solution in %.1fs
fi: Ei ratkennut, %.1fs

source: ERROR: No camera connected.
fi: VIRHE: Kameraa ei ole yhdistetty.

source: Connecting to camera...
fi: Yhdistet‰‰n kameraan...

source: No window matches search pattern
fi: Yksik‰‰n ikkuna ei vastaa hakulauseketta

source: Exposing: %.2f seconds
fi: Valotetaan: %.2f sekuntia

source: Exposing: %.1f seconds
fi: Valotetaan: %.1f sekuntia

source: Waiting for camera
fi: Odotetaan kameraa

source: Reading image from camera
fi: Luetaan kuvaa kameralta

source: Aborted.
fi: Keskeytetty

source: Camera did not produce an image to solve
fi: Kamera ei tuottanut kuvaa ratkottavaksi

source: Camera error:
fi: Kameravirhe:

source: ERROR: No telescope connected.
fi: VIRHE: Jalustaa ei ole yhdistetty

source: Waiting for scope to stop
fi: Odotetaan jalustan pys‰htymist‰

source: ERROR: Telescope connection lost
fi: VIRHE: Jalustan yhteys kadotettu

source: Re-centering...
fi: Keskitet‰‰n...

source: Edit bookmarks
fi: Muokkaa kirjanmerkkej‰

source: Cancel
fi: Peruuta

source: Declination
fi: Deklinaatio

source: Rotation
fi: Kierto

source: Bookmark name
fi: Kirjanmerkin nimi

source: Invalid values on row(s):
fi: Virheelliset rivit:

source: Bookmark coordinate error
fi: Kirjanmerkin koordinaattivirhe

source: Delete bookmark
fi: Poista kirjanmerkki

source: New bookmark
fi: Uusi kirjanmerkki

source: Camera Setup
fi: Kameran asetukset

source: Close
fi: Sulje

source: Camera interface selection
fi: Kameran valinta

source: Camera:
fi: Kamera:

source: Refresh list
fi: P‰ivit‰ lista

source: Refresh camera selection list
fi: P‰ivit‰ kameravalintalista

source: Binning:
fi: Binnaus:

source: Camera binning
fi: Kameran binnaus

source: About AstroTortilla
fi: Tietoja AstroTortillasta

source: AstroTortilla is aimed for automating telescope GoTo corrections using plate-solving. It uses a simple wrapper library for telescope control, image capture and plate-solving. See the files README and LICENSE for details. AstroTortilla and the library are licensed under the GNU General Public License v2. AstroTortilla and the library use:
fi: AstroTortilla on suunniteltu automaattisiin GoTo korjauksiin k‰ytt‰en kuvakent‰n ratkontaa. Se on toteutettu ohuena kirjastona kaukoputken, kameran ja ratkonnan hallintaan. Lue README ja LICENSE saadaksesi lis‰tietoja. AstroTortilla on lisensoitu GNU General Public License v2:ll‰. AstroTortilla k‰ytt‰‰ seuraavia moduleja:

source: Telescope quirks setup
fi: Ajurivirheiden kompensointi

source: Slew settle extra wait
fi: Pys‰htymisen lis‰viive

source: Telescope property caching
fi: Kyselyjen pienin aikav‰li

source: Log level
fi: Lokitaso

source: Active log level
fi: Aktiivinen lokitaso

source: Clear
fi: Tyhjenn‰

source: Clear the log
fi: Tyhjent‰‰ loki-ikkunan

source: Copy
fi: Kopioi

source: Copy selection or all to clip board
fi: Kopioi kaikki tai valitut rivit

source: Add current solution
fi: Lis‰‰ t‰m‰nhetkisest‰ ratkaisusta

source: Add from solved image
fi: Lis‰‰ ratkottavasta kuvasta

source: File
fi: Tiedosto

source: Bookmarks
fi: Kirjanmerkit

source: Tools
fi: Tyˆkalut

source: Help
fi: Ohje

source: Information about the application.
fi: Tietoja sovelluksesta

source: About
fi: Tietoja

source: Load settings...
fi: Lataa asetukset...

source: Save settings...
fi: Tallenna asetukset...

source: Exit the application
fi: Poistu sovelluksesta

source: Exit
fi: Poistu

source: Goto Image
fi: Avaa kuva ja siirry

source: Polar alignment
fi: Napasuuntausavustaja

source: Drift shot
fi: Ota valuntasuuntauskuva

source: Log viewer
fi: Loki-ikkuna

source: Telescope
fi: Jalusta

source: Camera
fi: Kamera

source: Actions
fi: Toiminnot

source: Setup
fi: Asetukset

source: Setup camera
fi: Kameran asetukset

source: Dec:
fi: Dekl:

source: Right ascension
fi: Rektaskensio

source: No camera
fi: Ei kameraa

source: Telescope driver workarounds
fi: Kaukoputken ajurivirheiden kompensointi

source: Field size:
fi: Kent‰n koko:

source: Rotation:
fi: Kierto:

source: Normal
fi: Normaali

source: After solve:
fi: Ratkaisun j‰lkeen:

source: Status:
fi: Tila:

source: Slewing
fi: Siirtyy

source: Tracking
fi: Seuraa

source: Exposure:
fi: Valotus:

source: Exposure time in seconds
fi: Valotusaika sekunneissa

source: Current:
fi: Nyt:

source: Target:
fi: Kohde:

source: Sync scope
fi: Synkronoi jalusta

source: Repeat until within
fi: Toista kunnes alle

source: Capture and Solve
fi: Valota ja ratko

source: Solver
fi: Ratkoja

source: Solver configuration
fi: Ratkojan asetukset

source: Re-slew to target
fi: Keskit‰ kohde

source: Previous solution
fi: Edellinen ratkaisu

source: Flipped
fi: Peilikuva

source: Last error: %s
fi: Viimeisin virhe: %s

source: Camera error
fi: Kameravirhe

source: Aborting...
fi: Keskeytet‰‰n...

source: Abort solver
fi: Keskeyt‰ ratkoja

source: ASCOM Telescope sync error
fi: ASCOM synkronointi virhe

source: Telescope communication error
fi: Jalustakommunikaatiovirhe

source: Invalid data
fi: Virheellinen tietue

source: Load settings
fi: Lataa asetukset

source: Config files
fi: Asetustiedostot

source: Save settings
fi: Tallenna asetukset

source: Error saving settings
fi: Virhe tallettaessa asetuksia

source: Drifting: %.2f seconds
fi: Valutaan: %.2f sekuntia

source: Drifting done.
fi: Valunta tehty.

source: Solver error
fi: Ratkojavirhe

source: No current solution
fi: Ei valmista ratkaisua.

source: Creating bookmark from current solution
fi: Luodaan kirjanmerkki‰ t‰m‰nhetkisest‰ ratkaisusta

source: Enter a name for the bookmark
fi: Annan kirjanmerkin nimi

source: Done
fi: Valmis

source: Creating bookmark from image
fi: Luodaan kirjanmerkki‰ kuvasta

source: Polar Alignment
fi: Napasuuntaus

source: Observer Hemisphere:
fi: Havaitsijan pallonpuolisko:

source: North
fi: Pohjoinen

source: South
fi: Etel‰

source: Mount altitude
fi: Jalustan altitudi

source: Mount azimuth
fi: Jalustan atsimuutti

source: East
fi: It‰

source: West
fi: L‰nsi

source: Measurement side:
fi: Mittauksen puoli

source: Measure altitude error
fi: Mittaa altitudivirhe

source: Measure azimuth error
fi: Mittaa atsimuuttivirhe

source: Point the telescope to the meridian before measuring!
fi: Osoitan kaukoputki meridiaanin suuntaan ennen mittausta.

source: Point the telescope to the east or west before measuring!
fi: Osoita kaukoputki it‰‰n tai l‰nteen ennen mittausta.

source: Measured altitude error:
fi: Mitattu altitudivirhe

source: Measured azimuth error:
fi: Mitattu atsimuuttivirhe

source: Telescope error!
fi: Jalustavirhe!

source: Slewing...
fi: Siirryt‰‰n...

source: Done!
fi: Valmis!

source: Abort solver!
fi: Keskeyt‰ ratkoja!

source: An error occurred!
fi: Tapahtui virhe!

source: too low
fi: alle

source: too high
fi: yli

source: too east
fi: id‰ss‰

source: too west
fi: l‰nness‰

source: Downscaling
fi: Pienenn‰

source: Image downscaling factor
fi: Pienennyskerroin

source: Backend config
fi: Asetustiedosto

source: Cygwin path to backend config file
fi: Cygwin -polku asetustiedostoon

source: Radius of search area in degrees
fi: Hakualueen s‰de asteina

source: Search radius
fi: Hakus‰de

source: Image scale lower bound
fi: Kuvaskaalan alaraja

source: Scale minimum
fi: Skaalan alaraja

source: Image scale upper bound
fi: Kuvaskaalan yl‰raja

source: Scale maximum
fi: Skaalan yl‰raja

source: Scale units
fi: Skaalan yksikkˆ

source: View scale size units
fi: Kuvaskaalan koon yksikkˆ

source: 0 to turn off
fi: 0 = pois p‰‰lt‰

source: Image scale refinement factor
fi: Kuvaskaalan tarkennuskerroin

source: Scale refinement
fi: Skaalatarkennus

source: Additional custom options
fi: Lis‰tt‰v‰t komentorivivivut

source: Custom options
fi: Lis‰vivut

source: Cygwin shell
fi: Komentorivi

source: Shell command for Cygwin execution
fi: Cygwin komentirivik‰sky

source: Hide Cygwin
fi: Piilota Cygwin

source: Hide Cygwin window while solving
fi: Piilota Cygwin-ikkuna ratkonnan ajaksi

source: JNOW or J2000
fi: JNow tai J2000

source: JNow or J2000
fi: JNow vai J2000

source: Local astrometry.net
fi: Paikallinen astrometry.net

source: Parsing results...
fi: Parsitaan tuloksia...

source: Username
fi: Tunnus

source: Web solver username
fi: Web ratkojan k‰ytt‰j‰nimi

source: E-mail
fi: S-posti

source: E-mail address
fi: S‰hkˆpostiosoite
